[{"title":"Timeline","date":"2018-01-27T02:10:23.000Z","path":"2018/01/27/Timeline_for_Jan_2018/","text":"27 update: 考试周顺利结束了 1.3 数逻实验验收 OOP lab7 1.4 哲学展示 1.5 大英quiz 2 1.7 数逻大作业DDL 1.13 日本艺术欣赏考试 1.18 大英Final 数逻Final 哲学Final 1.19 概统Final 1.21 大物实验理论Final 物理与人类文明Final 1.23 大物Final 1.26 OOP Final DS Final 1.27-1.29: ASC初赛题","tags":[]},{"title":"2017年度总结","date":"2017-12-30T08:02:19.000Z","path":"2017/12/30/2017年末总结/","text":"7102年就要过去，按照惯例写一下今年的年度总结。往年的写法是按照各个方面写，今年也一如既往延续这个惯例。 学校 大一下均绩4出头，依旧是数学拖后腿。离散学的还行，在C大程课上学会了基础使用$\\LaTeX$，在无线网络应用课上学了一些基本的网络知识。 短学期自己的状态很不错。总评一共扣了4.5分，可以认为是学的不错了。 大二下开学加入了超算队，目前仍在摸索中。目标是明年的ASC拿奖金 一番繁琐且不是十分愉快的折腾，姑且还是进入了何班。 大二上学期总体的学习情况评价下来是令人不满意的，主要问题是时间规划，有些课确实不需要天天听，需要的是突击。但是有些课还是得听，至少，每周跟上进度。当然，这和贵校授课水准有不可脱离的干系，贵校这授课水平确确实实不如自学，只是我自学的时间安排还不够合理。期末将至，天大的坑需要补。 熟能生巧：日语水平飞增。 逆水行舟，不进则退：英语水平飞降。 人际关系 认识了一些靠谱的同学。 短学期结束的时候，和父母去南京玩了2天，算是多少年以来第一次一家三口出去玩（主要是我不在 和室友的关系比以前融洽。 同样的，认识了很多傻逼，虽然一直告诫自己不要被傻逼影响，但是还是忍不住去恶心、反胃，引以为戒，告诫自己人类的底线不过如此，千万不能成为这样的物种。 娱乐书 2017的杂书看的很少，一本东野圭吾的《嫌疑人X的献身》，一本米泽穗信的《事到如今才让我飞翔》，其余的也不曾想起来。 2017看的主要还是教材，虽然最后很多都没看完…… 可以看出，2017年是纸质知识相当匮乏的一年，加入超算队前几周还打了几篇论文准备看，但是之后忙起来也就放一边了。Uta同学提的很对，在新的一年到来之际，应该每天（或一周四到五天）规划出固定的看书/论文时间，大学时代是所剩不多还能大规模补充知识的时间了，要利用好啊。 电影 1月份回家后照例看了君名，以10次的不俗战绩画上了圆满的句号（虽然小圆盘至今还没有购买） 整个大一下都没看电影，直到考完C大程和sgsp以及嘉琛去吃湘菜，吃完突然决定去看变形金刚。之后吃了个抹茶冰淇淋，从此抹茶上瘾。 《声之形》：军训结束当天看的，怎么说呢，国内删减了20min，导致不知道是故事本身迷还是删去了许多小细节导致的故事很迷，ANLOF非常喜欢，买了三套圆盘，找个机会我也应该从头补一遍声之形。 《刀剑神域–序列之争》：意外的还行，这种真的就是纯粉丝向作品了，但看得挺爽的。 《东方快车谋杀案》：一个周二的下午去看的，电影不错，但是最有意思的还是看着贵校一个人全程装逼说自己读过原作，最后发现意料以外的结局时那番滑稽的模样。 没看到的想看的电影一部是《寻梦环游记》一部是《烟花》，前一部好评如潮想看，后一部是知道很烂但是想花钱听《打上花火》，可惜确实腾不出时间。 游戏 寒假回去没怎么打游戏，和yby他们上过几次网，三月份闹崩之后就几乎不再碰dota了。 五月份左右购入PS4，玩了尼尔、黑魂、血缘，都很棒。 七月份入坑CGSS，一直玩到现在，微氪了些许。 大二身边没PS4，常驻512，几乎没再玩过steam上的游戏。吃鸡确实是电脑带不动，之后再说吧。 动画 今年动画似乎看的也不多，追完的新番：《埃罗芒阿老师》、《偶像大师灰姑娘女孩 剧场》一二季 补完的番：《吹响，上低音号！》第二季、《NEW GAME!》、《偶像大师灰姑娘女孩》 剧场版：《春宵苦短，少女前进吧》 同样今年的留给动画的时间也不够多，但是不可否认，我觉得今年的业界看上去比前几年有希望多了，有很多值得一补的动画。 企划相关 4~7月份的时候是狂热的京厨，起因于重温及补完京吹。期待京吹的原创剧场版。 7月份不知怎么从京吹入了CG的坑（九成是tomoyo的锅 CGSS玩爆、ASL2015、ASL2016交替着看，到开学前，已经成为了一个狂热的CG p，同时CG 4th BD的PV陆续放出，当时看着PV挺感动的，一狠下心也就剁了手买了。 回学校的这一天BD发售，在高铁上看到B站上有Up在直播，到学校第一件事就是看生放。晚上开完军训第一个会议回来，躺在床上继续看，妈蛋前面什么都没问题，却在看到全场黑屏合唱GOIN!!的时候鼻子一酸。 十一回家BD看爆。 十一月开始准备，十二月八日九日前往上海参加了CG或是说整个偶像大师企划在海外的第一场专场活动，5th live viewing以及FMT。这是我今年做的最好的决定没有之一。带给我的快乐是其他所有都无法相提并论的。 偶像大师赛高！ 遗憾 都要8201了我的算法水平还是这么菜，同理数学。 没有加入正儿八经科研的实验室，主要还是在纠结是去搞CV上AI的车还是去搞并行相关的研究，无论如何，这个寒假得定下来。 英语水平。 还是没有拿得出手的用的得心应手的一门编程语言。 时间安排显然不够科学。 还没去过CG的演唱会 展望2018，希望会更好。","tags":[{"name":"thoughts","slug":"thoughts","permalink":"http://yoursite.com/tags/thoughts/"}]},{"title":"十月杂谈","date":"2017-10-29T12:33:22.000Z","path":"2017/10/29/十月杂谈/","text":"十月还没完全过完，提前先写了这个月的总结吧。 一如既往地扯些别的。 首先现在的域名明年一月就要到期了，在考虑换一个域名，同时也在考虑换一套 Hexo 的主题。 昨天下午终于吃到了金拱门，爽爆，撑爆，虽然很忙，但能挤出时间出去吃这么一餐还是挺值的。 言归正传，十月初是国庆长假，在家里好好放松了一下，没有完全没有目的的一天，每天至少都知道有事可做。回学校之后被 DS 查重的问题严重干扰了一周半之久。再加上这个学期大物实验、数逻、DS都要写又长又臭又没用的报告，所以整个月都很忙，每周周末两天都几乎是用来写作业，写的还是很傻逼很弱智的作业。额外就仅仅学了一点点CUDA，这几天UCD的评测机还坏了……交不了 P4。 这种感觉好吗？当然不好，每天十点多才回寝室，洗个澡就要睡觉，时间花的确实是很多，但是几乎没有学到任何有价值的东西。 列一下11月份要完成的事情: 给宋教授写邮件，加入实验室 通过期中考试 看并行的两本书 每天保证一个小时读书时间 早点把DS都解决了 《CSAPP》《机器学习》 就这么些吧，这些都不一定弄得完。 这几天云峰外面挂了一条横幅“你今天真好看”，每次看到第一反应就是想起照相法实验时那个女生，她那天真好看啊。 最近一直听东京事变，洗脑。","tags":[{"name":"thoughts","slug":"thoughts","permalink":"http://yoursite.com/tags/thoughts/"}]},{"title":"DS","date":"2017-10-23T13:31:07.000Z","path":"2017/10/23/DS/","text":"纵使忙到爆炸还是打算写一篇这样的东西，免得时间一长了又被我遗忘。这将会是一篇很真实的文章，我最终还是没有在知乎、校内论坛发这样的东西，但这并不意味着我会以一种优化后了的状态来试图把这篇文章中的世界刻画的稍微美好那么一点。 事情发生在10月11日晨，刚从国庆长假回来，连着忙了两天半，有空睡个懒觉准备上DS，醒来看手机发现SH跟我说她DS被查重了，当时还没太在意，还想着她又干了什么好事，结果查了下自己的邮箱发现自己也收到了这样一封邮件： 同学你好： ​ 经查重发现您在DS课程上作业HW2中存在抄袭行为（pintia昵称：XXX，题目6-2代码相似度100%），我们决定取消您的DS期末考试资格。 说的风轻云淡，手下的却是狠得不行。我当时脑子就是懵逼的，赶紧打开网站看到了这道奇妙的6-2和我的代码，这道题是10月3日在家里的时候写的，那天下午和东南大学的刘同学自习的时候发现DDL快到了于是晚上回去赶紧写了，代码很短，一遍AC。最初本有个很一般的思路，发现传进来的不是二级指针，不想再遍历一次于是直接换成了最后这个原址旋转的方法。嗯，都回忆起来了，于是便赶紧开始写邮件联系助教与老师，第一封邮件写得十分相识，整个做题过程，思路都写了一遍，就差把做题时喝的饮料的牌子说出去了，此外还特意提了我根本没有抄袭的动机。 上课之前，特意去问了F老师，F老师也很直白，说申诉邮件不用写任何思路之类的东西，反正他们不看，要的是对这种高度相似的情况给出合理的解释。神TM合理的解释，我自己一个人在家写的，我神TM会知道这个世界上哪一份代码和我100%重复，要是和我自己的提交查重还好说。F老师说了我可以找助教要两份相似的代码。 下午上数逻课，此时，计院/学校/知乎有名的C老师，在98挂出了一份令人震惊的名单，挂了44个人，一并给出了几乎等于没打码的ID和真名。瞬间无论是论坛还是实验室里，都炸开了锅，为什么，很简单啊，大家都没抄，怎么可能会有这么多人去抄袭这么弱智的题目，可现在都要挂科。在这份名单里，除了一些我认识的人之外，特别值得注意的是校ACM队全军覆没，真是绝了。C老师倒是丝毫不在意，咄咄逼人，例如，她的标题是： 以下同学，下周数据结构基础不用继续上了 再例如，她有这样一句话： 后面的课可以上成小班课了，愉快。 此时我还没和C老师有过任何接触，但是我还是不免感到一阵反感。不过这个时候有了另一种可能性，因为C老师发现她的助教很有可能提交了两次代码导致同学们和自己被查重了，我此时只能希望我也是这样被助教误操作误杀的一个人。 下午三点收到了F老师发来的邮件，确实看到了两份不同名字，除了变量名和缩进几乎完全一样的代码。说实话，这事发生在我自己身上之前，我也认为如果两个人的代码是如此高度相似那肯定是有问题的，可是现在的情况就是我啥也没干，我相信他也啥也没干，恰好撞在一起了，这样的可能性是有的，毕竟代码就那么简单几行。对了，F老师的邮件里有这么个说法： 如果如XXX同学一样所说两个人完全自己写也可以写成这样一摸一样的代码。 那么请你们安排一个你们认为的任何一个合适的时间，请你们完成一个简单作业，如果代码能这样一摸一样，那也是能够给个证明非抄袭也能一摸一样。 乍一看挺有道理，我当时一想，我又不像某些特例，自己以前在PTA上写过，可以拿自己以前的提交来证明自己做过以证明自己的清白，那要么就写吗，早点解决早点好。然而，在周围同学的分析（劝阻）下，我冷静的思考了一下，这根本就不是一个靠谱的解决方案，因为就算我自己在不同时间写同一份代码也很大可能无法写的完全一样，跟不要说两个陌生人写一道别的题目。这封邮件本就不是为了给我们一个公正的解决方法，而是基于有罪推定的情况下发来的挑衅。冷静分析下来，还是通过群发邮件时留下的另外一个同学的学号找到他本人更合理一些。 然而这个同学着实和我没有任何交集，我在QQ的所有群里没有找到他，通过16级的万事通Z同学找到17级的万事通S同学，终于找到了他，和他大发一顿牢骚，确定了肯定不去接受所谓“写同样的代码”的试炼。 这一整天下来都无心上课学习，晚饭也没吃，回512时恰好看到班主任H老师在准备上数逻，于是便和他把整件事都讲了一遍，他人真的很好，听我讲完了整个过程，也对我的遭遇表示了理解，顺便询问了一下DS课的一些细节，最重要的是他答应我第二天就去玉泉找F老师问一下这件事，对此我是非常感谢的。 晚上和同学、学长的吐槽不再复述，不过知道了很多关于DS，关于C老师的故事，这些故事怎么样我不评判，但还是一样，不太舒服。十点左右的时候给F老师写了一封邮件，大意就是不接受她给的解决方案，同时强调两点，一是我和这同学没半毛钱关系，大一我们无论是上过的课程、参加的社团/组织、加过的群都没有任何的交集，二是我目前的CS水平还不至于贫瘠到抄袭这么弱智的题目。 第二天起来一直在刷邮箱，没反应，听从Z同学的意见，给课程组组长也就是C老师写了一封邮件，大意就是将这个试炼是极其不合理的，希望C老师给个公正的评判。刚写完，就收到那位和我撞代码的“有缘人”发来的消息，说他找到了实锤，那就是他在作业没布置之前就写过这道题，他有当时的提交记录和代码，于是他也给C老师发了邮件。虽然没报多大希望，但确实也没啥好的结果，C老师口口声声讲着理科生的理性思维，实际上根本不管你背后有这样那样复杂的原因，她只看代码，看代码我们就是抄袭，她也是一口咬定，也是要我们进行那般“合理”的试炼为我们正名。此外，F老师也一直对我们进行冷处理，就是完全不理的状态。我没有办法只得继续求助于班主任，班主任去了玉泉，但是并没有找到F老师，他提出了另一个老师的看法：我们两人都在网上抄袭了同一份代码。显然这也是不存在的，然而解释起来也依旧麻烦。剩下的时间我就和班主任狠狠地吐槽了一番DS以及某些老师，很爽。 当然，为了不再被冷处理，我和那位同学商量好，还是先把姿态放低，表示出愿意接受“试炼”的想法，前提是必须先等我们给出我们自己的理由以及证据。 周五上午收到回复，很简单，就是让我们周三去找F老师。当然我这边也不能就这样干等着，因为这种被人冤枉的感觉太不好受了，而在这前两天和老师们打交道的过程中我感到了强烈的被有罪推定的感觉，那么我不得不做好万一继续被冤枉就得走上向上申诉的路，学院、校长办公室都是备选的方案。但紧接着又收到一封有意思的邮件，大意就是第一次作业，同学们“认错”态度好，现在写邮件承认错误总分扣个十分，大家就当没事发生过。真TM精彩，颇有一副招降的感觉，呵呵，SH同学还真就这么写了一封投降邮件，原因就是她嫌折腾了太久不想再折腾了。这活脱脱就是一个钓鱼的把戏。 浑浑噩噩度过周末，到了周日晚上，ZZH同学很惊讶的告诉我说C老师说所有的招降/投降都是没用的，该挂的一个都跑不掉，他以为我是投降了的，我会吗？ 周一听闻Z老师班上挂了27个，好巧，Z同学把我拉进了主要由Z老师班上被挂同学建的查重申诉群，但主要那个群还是由一些确实误操作触犯了诚信守则的人组成的，我也没有多参与了。 一直等到周三，我这边也没什么新的动向了，去上课时还是相当紧张的，主要是怕继续被冤枉，怕继续往上申诉会带来更多的麻烦，我是真的耗不起了，我要是有任何一点点作弊行为早就招了，这一周的心理压力真不是一般人受得了的。 最后解决的方式也十分扯淡，F老师也根本没听我们任何一个字的申诉，直接让我们写了一份之前一样的题目，再多写了一道链表的最大最小值，然后拿去和我们自己提交的代码进行风格比较。下午两点，收到了邮件： 不再认定作弊，保留考试资格 没有道歉，用词是“保留”，绝了，不过事已至此我也算是心里一块大石头落了地，总算是解决了。 这么流水账的、思维紊乱的、想到什么写什么的记完了这件事，确实心累了，也不想写的仔仔细细，但是经过这件事，我确实认清了一些东西，首先，贵校的DS课程已经和DS无关了，只剩下了弱智查重，弱智互评，弱智写文档，学生们花大量宝贵的时间在这些弱智事情上，毫无意义。第二，贵校某些老师令人发指，毫无师德，当然，这可能也和其本人有关，其本人可能本就歧视贵校学生，认为贵校学生并不会写一个简单的反转链表，所以需要抄袭，所以才引入如此一个诚信守则来挂科。第三，以后为了避开这些东西，能拿别的语言写的我都会拿别的语言写，我不想再折腾。这一个星期以来的折腾折腾坏了我大批脑细胞也浪费了我大量学习的时间，这一点是某些老师永远无法赔偿的。嘛，好在，经过这一件事，母亲总算是认清了贵校三本本质，世一大，世一大。","tags":[{"name":"thoughts","slug":"thoughts","permalink":"http://yoursite.com/tags/thoughts/"}]},{"title":"夜间飞行","date":"2017-09-30T17:26:41.000Z","path":"2017/10/01/夜间飞行/","text":"四月份夜跑的时候便注意到了，到了夜晚，紫金港的天空上会有不少飞机飞过，或是民航客机，或是空军的战机，客机亮着红绿两色的灯，缓缓掠过，慢慢升高，消失。 那时候就很好奇，很想试试这样的夜间飞行是怎样的体验，想感受一下在高空中俯瞰这片漆黑时的心情。 今天很有幸，没能订到下午的航班，于是乘着这一班夜间的航班飞回了家。可惜，距离不算太远，还没飞多久便要降落，更可惜的是，飞向家的方向和紫金港的方向恰好相反，没办法成为自己能看到的那一班夜间飞行了。 嗯，确实没有什么特别的体验，下次有机会再说吧。 总而言之，当下已经是十月一日了，九月已经结束了，此时总结一下并是极好的，之前就很想写写，但或是因为懒或是因为有事在身都推迟了，这次定是要写完，毕竟九月已经过去了。 军训首先必须提的当然是军训。无论如何，我无法认同军训存在的价值，太弱智了，太傻逼了，官僚主义、形式主义、反智主义的温床，当然，这是全国高校的通病，毕竟是上面要求的ZZ任务，但是贵校某些地方干的更傻逼，简直让人无法生活。 但是也是有一点收获的，首先吧，稍微矫正了一下我的形态，至少短时间内，脖子正过来了，虽然上了两周的课脖子又歪回去了……另外，看清了很多人傻逼的真实面目，这省了很多事，非常妙。当然，也认识了几个朋友，这也是没想到的意外收获，确实有几个朋友在能让军训轻松很多。值得一提的是最后阶段，最后的晚会确实相当精彩，也相当煽情，虽然我是一个没有眼泪的人，但确实被打动了，人与人之间确实容易产生感情啊。 总而言之，利弊相当吧。 开学其实开学并没有太多惊天动地有代表性的事可以写，但怎么说都是大二了，多少该有点不同了，哪怕是自己想办法创造的。 首先是算是半加入了超算队（因为正式名单还未确定）。我还是非常珍惜这个机会的，毕竟我自己什么水平我自己心里很清楚，也非常希望自己能靠这个机会，在这个环境下快速高质量的提高自己。要学的东西很多，尤其自己大口一开说要搞DL，DL少不了各种数学知识，有些需要预习，有些又需要重学。还要学Python，C++这些语言基础，以及超算要用到的各种工具和并行运算的理论。划水的时间可能只够打CGSS了。当然，还不能丢了课表上的这些课。 为什么这么说呢，因为进入大二才意识到自己大一的浪带来了多大的后果，绩点不高真的是寸步难行，奖学金无缘，求计表刷，何班连申请表都不敢填。最恐怖的是意识到之后越来越难刷上来，但是也没有别的路可以走了，只能把每一门选上的课的绩点都刷高，虽然基本都是在自学。 和雅礼的后辈们算是聚了一次会，非常感慨，这一届的竺院比例高的恐怖，就没几个不是竺院的，后生可畏啊。 怎么说呢，感觉真正到了要写的时候又写不出什么东西来了，所以说有些感悟还是得及时记录，否则转瞬即逝。 若是想到遗漏了什么，之后再补也不迟。 继续学习，继续攒星抽卡，希望能多出点SSR。","tags":[{"name":"thoughts","slug":"thoughts","permalink":"http://yoursite.com/tags/thoughts/"}]},{"title":"暑假的最后一天","date":"2017-08-28T15:11:33.000Z","path":"2017/08/28/暑假的最后一天/","text":"今天是八月二十八，是我所拥有的暑假的最后一天，明天就要去学校了，面对的是两周的军训，我是很讨厌甚至有些恐惧军训的，丝毫不能理解其价值或是存在的意义，无论如何，希望这两周快点过去，正常开学。 暑假的结束标志着大一的正式完结，第一学年是不尽人意的，但想来想去也没有办法做得更好，一切在入学的时候就定下了不良好的基调，但好在总算是在向好的方向回转，希望下个学期能做的更好吧。 这个暑假还是过得相当的开心的，可以简单总结一下，以便以后得以回味。 Part 1第一部分打算讲讲娱乐，玩是玩的很开心的，依旧没有配PC，但是有手机和PS4，笔记本配块屏幕和键盘，也玩的挺开心。 七月初因为看2015，2016两年的ASL，入了偶像大师灰姑娘女孩的坑，也玩上了游戏，假期过程中全程跟了活动，也关注了福冈和SSA两次Live，在推特上刷到中之人们发的照片，相当的有趣，感觉自己变成了半个呸氏推。 PS4上通关了血源本体+老猎人DLC，卡的最久的是科斯的孤儿，那段时间真的是一次次的死，一次次的冲进boss房，又继续死，但是可以明显感觉到自己在变强，最后某一天吃完晚饭坐下来准备死第两百多少多少次时，不经意间发现boss的血条被我一次次内脏暴击打得只剩一点了，还没反应过来居然就打过了，倒是没有想象中那么大的成就感，反而还有点意外。整个游戏是非常非常不错的，手感，关卡设计，boss，以及整体的故事背景和氛围熏染，我认为甚至做的比之后的魂3还要好，可能是我更喜欢这类阴暗的游戏吧。二周目稍微玩了一会儿，深刻的感觉到经过了自己一周目那样惨烈的被虐后自己变得更老练了。还有迷宫没打，有时间再说吧。 黑魂3打完双王子，还有几个支线boss和薪王化身没打，当然以及两个DLC，有时间再说吧，尼尔是全程搁置，不是很想玩。 PC上倒是挺意外的玩了不少游戏，笔记本玩不起现在流行的吃鸡，然而却意外的在玩小游戏，和CQY出去那次玩了下LIMBO，打到了相当后面的进度，自己又买了个游戏KAMI，很图论，很难，玩到B组就卡住了，但日式和风的氛围很好，即使难也不会让我感到烦躁，反而可以继续思考瞎试，去学校后闲着没事可以继续玩。Fallout shelter，这个和辐射4同时发布的小游戏，我在刚发布的时候就用touch玩过，不过那时移动端很不稳定，非常容易闪退，也就搁置了。然而和沁狗等人出去玩那一次，看沁狗玩这个游戏发现比记忆中好玩很多，之后回家了也玩了很久，当然，现在玩到避难所发展的中后期，都是当开心农场玩了，隔几个小时上去做个任务，也挺休闲。 当然，娱乐不仅仅限于游戏，看完了一季NEW GAME，CG的全集，虽然不多，但都还是不错的作品，看得也很开心。读完了冰菓的第六卷，故事线变得更多变复杂起来，希望有生之年能看到由京都动画出品的冰菓的第二部动画，BD是一定会买爆的。 Part 2第二部分谈谈学习，比起基本没干正事的去年暑假和今年寒假，这个暑假读完了三本书，分别是Essential C++, C++ Primer, Learn you a haskell for great good, 分别对应了这个暑假学的两种语言。 说是读完，其实还是相当囫囵吞枣的，看C++ Primer的时候，就是“哦，原来如此”，“哦，你说的对”，”哦，很合理“，然后自己思考的时候就是一脸问号，是，这门语言是很强大，但是我始终觉得它太过复杂，太过繁琐。不过我还是打算好好掌握这门语言的，这意味着接下来还要花更多的时间重读旧书，读更多的新书，写更多的code，回味消化。 另一方面，haskell一开始给我的感觉就是很魔法，因为这是一个全新的领域，和C, C++不一样的领域，在这之前我完全没有接触过的领域。看书里面这样写，但自己并不能理解为什么要引入这个概念或是这个特性，只能不停的回味，思考，google，知乎，好在网上还是有很多不错的学习资源。它的code写出来也是别样的风味，要把思维从之前转换过来，说实话还有点困难+需要时间。 算法稍微看了一点点，感叹真正的世一大的优越性，人家的作业是直接给tex模板的，填答案就好…… NLP没看，数学没看，啊好咸鱼，不能再把大块时间花在学新语言上了….. Part 3假期基本上是宅在家中，偶尔几次出门，大都是重逢相聚。 和CQY，LZY的相聚碰到了一群高一的同学，感叹长沙真小，但意外的重逢令人激动。 和沁狗，LZY，WY，TCW的重逢吹了很多水，听到了很多小道消息，也看沁狗玩了游戏，这真是世界上最有意思的事。 和小学同学重聚，真是久远，久远到差点都要忘记。 和沁狗重回雅礼，没看到多少老师，但，也是相当美好的夏日回忆。 基本上就是这一些了，该早早睡觉了，深刻感叹自己本就可怜的语文水平已经降至了负数。 要是能贴一两张照片作为结束该多好，可惜没有什么照片。 照惯例，一曲：","tags":[{"name":"thoughts","slug":"thoughts","permalink":"http://yoursite.com/tags/thoughts/"}]},{"title":"杂记","date":"2017-08-13T16:13:11.000Z","path":"2017/08/14/杂记/","text":"今日下午犯困，一觉醒来外面暴雨下得正猛。今日已是八月十三，今日有两件事落下了帷幕。 TI首先是TI，距我上一次打开dota2已经过去了好几个月，之后估计也会有很长时间不会再玩，但是今年的TI还是依旧从小组赛开始每天都有收看的，虽然每天都在催促自己早点睡，但是看着OB的直播总是一下子就到了两三点。 今天凌晨也是如此，看LFY和Liquid的败者组决赛。我最想看到夺冠的B神半路输给了自己的状态，怨不得谁，所以基本上之后也是抱着吃瓜的比赛在看剩下的比赛，令我比较意外的是LFY这个队伍，在我看来是中国队中状态最好的，打的比赛也相当有观赏性，尤其是LFY vs VP的Game 2，非常精彩，整个人都看得精神抖擞，我认为它有冲击冠军的实力。然而没想到居然是Newbee率先进入总决赛，我不喜欢这只Newbee，主要是我不喜欢kaka这个选手，我认为他实力并没有他被吹嘘的那样高。 Liquid是今年国外队的最后一根独苗，然而，当它和LFY的比赛开始后，所有明眼人都可以看出，这支队伍已经不是那个被IG打入败者组的队伍了，它显然强了很多倍。在看完了紧张的Game 1和几乎碾压的 Game 2后，我困得不行，选择睡觉，为LFY担忧，最后一场显然会是一场恶战，LFY真的凶多吉少。 虽然四点钟才入眠，但是八点钟也醒了，这个时候总决赛应该早就开打了，果然，LFY并没能战胜Liquid，同时，我也非常意外的看到总决赛的比分已是Liquid 2:0 Newbee，仔细一想其实也不意外，Newbee确实没这个实力。最后一局我从头看到了尾，只能说这只Newbee在让人失望上从不让人失望，打得毫无骨气，输的颜面全无，3:0，TI史上首例零封，OB的老骨头们都是难过扎心，确实看着叫人难受。之后去U2B上补齐了LFY最后一场和总决赛前两场，这一对比下来，Newbee输得更丢人了，选手几乎都被打懵逼，创造了TI史上最无聊的决赛。只能庆幸自己还好没有为了看这样丑陋的比赛而通宵。 另一方面，CGSS群里有位dalao去TI现场观战了，很是羡慕，虽然他本来看着中国队形势一片大好想去见证蝉联冠军的，结果最后被一片“Let’s go, Liquid!”包围了，心疼。但是有机会我也很想去TI现场观战，那肯定会是非常棒的体验。 5th另一件事就是CG 5th巡演的最后一站: SSA，这两天在微博、推特上云看了两天的演唱会，靠别人的repo、推特为生。 day1出演的CV中，有呸、cutter、tomoyo，演唱的歌曲里，Kawaii make MY day是我第一首活动曲，这次MY也到齐了，很期待在BD中看到这首歌。接着往下扫节目单的时候大家都炸了，太会玩了，各种翻唱，三个小队换着唱，这串烧的节目单看着就很有意思。 day2有hego，彩喵，ruru以及nao。节目单依旧保留了前一天的串烧风格，选曲也都很有意思。让我感觉亏了一个亿的是NG三巨头演唱了我最喜欢的歌Trancing Pulse，这真的是太令人意外，太令人期待了。对了，这两天的组合曲基本上都是人齐的，非常好，非常妙，很期待PCS的情书以及完整Lipps的Tulip。 明年的6th要上蛋了，虽然目前还没说在哪个蛋……有机会的话真希望能去日本亲眼看，实在不行去香港看看转播也行，当然能去日本肯定是最好的，可以顺路去冰菓圣地巡礼，这一件事也是挂念了很久的。 以上就是今日的杂记。夜已深了。","tags":[{"name":"thoughts","slug":"thoughts","permalink":"http://yoursite.com/tags/thoughts/"}]},{"title":"四叠半迷宫","date":"2017-03-22T05:42:15.000Z","path":"2017/03/22/四叠半迷宫/","text":"叠，日本用于计算面积的单位，一叠即为一张榻榻米的大小，而一张榻榻米的传统尺寸宽 90 厘米，长 180 厘米，大约即是 1.62 平方米。 而四叠半，即是四张这样的矩形榻榻米和一张正方形的榻榻米组成的一个正方形区域，按照换算，约合 7.29 平方米。 之所以提到这样一个概念，要从刚刚补完的一部2010年的老番 四叠半神话大系 说起。前些日子在网易云上漫无目的的听歌，突然发现一张名为 NOITAMINA FAN BEST 的专辑，收录了 2005 - 2015 年倒A档动画的精选 OP/ED。边听边翻看评论，在这首迷子犬と雨のビート 为数不多的评论之下，看到了难得一见的一致高评价，再加上 “玫瑰色” “大学”这样几个诱人的名词，我觉得这会是一部很合我胃口的番。 四叠半神话大系 事实是，这部番的优秀超乎了我的想象，时隔2年，我再次可以在 bangumi 上打下一个 10 分，神作，毋庸置疑。原作的剧本就足够优秀，大三的“我”，觉得自己度过了非常失败的前两年，要是当时选择了不同的社团，一定能够过上自己想要的玫瑰色的生活。于是，在平行时空下，“我”的故事重新开始，重新经历大学的前两年。然而，从网球社团到电影社，从自行车部到拜樋口为师，从暖暖社团到三位女性之间的纠结，即使是有了权利有了金钱，无论怎样，“我”始终过上了失败的生活，始终会因命运的黑线认识像魔鬼一样以他人的不幸而下饭的小津，始终没有黑发的美少女，始终没有过上被称为梦幻至宝的玫瑰色校园生活。 动画从第一集开始就令人惊叹，各种大胆的分镜，夸张的用色，“我”的超长超快独白，永远走不出去的OP，8 Bit电波ED，恰到好处的配乐，以及在诙谐幽默甚至时常有一些恶趣味的叙事之中对人性的多面性，对社会现象如传销的影射。现在才认识汤浅政明这位鬼才监督，惭愧惭愧。 这并不是这部番的全部，上面提到的剧情不过是前9话，“我”在平行时空里来回九次，给“我”提供咨询，让“我”抓住良机的老婆婆的收费也从1000日元到了9000日元，但似乎主线一直没有向前推进，我也一直是怀着看喜剧的心态坐在屏幕面前傻笑而已。但要是这样，这部番也不会算得上是神作。 在第9话的末尾，“我”和师傅有这样一段对话 – 好像很有趣，我却有一种走错人生路的感觉 – 你的人生还没有开始，这里只是母亲腹中的延续之处 –也不算差，我成功得到了令人羡慕的人生，但是总觉得少了点什么，人生就是这样的东西吗？或许还有更有意义的人生，或许会过上充满玫瑰色与光芒，没有一点阴暗的学院生活也说不定 – 怎么啦，还没睡醒吗? – 我是相信着自己的可能性才得到了如今的生活，虽然总算是成功了，但是总觉得心中空虚，我应该选择的或许是别的可能性，只是在一年级的时候做出了错误的选择 – 不可以随意使用可能性这个词，你能成为兔女郎吗，你能成为飞行员吗，你能成为偶像歌手吗，你能成为用必杀技拯救世界的英雄吗 – 成不了 – 或许能行也说不定，但是眼睛老是注视着不存在的东西是不行的，把希望寄托于自己别的可能性这种虚无缥缈的东西上，这正是万恶之源，你必须认同只能成为如今的你的自己，你肯定无法过上有意义的学生生活，我可以做保证，你就做好心理准备吧 – …… – 玫瑰色的学园生活什么的根本不存在，要说为什么，因为这个世界本就不是玫瑰色的，而是充满了各种颜色 “我”看到像魔鬼一样的小津为了和心爱的女朋友一起赏五山祭，去抢夺暖暖社团的飞艇，在舒缓的钢琴乐中，“我”想到自己至今为止一直过着无意义的生活，“我”以为小津也是这样，然而他却一直享受着这种无意义的学园生活，一事无成的只有“我”吗？ – 从这四叠半的宿舍里一步都不要走出去就好了 终于，“我”呆在了自己的四叠半之中，成为了“四叠半主义者”，这大概也算照应标题，这是可以料想得到的结局，可我却看出了一身冷汗，自己的影子，若隐若现。 一个人的生活很愉快吗？很自由吗？算得上是玫瑰色吗？也许吧，但当“我”有一天想要走出这间仅有四叠半的屋子之时，突然发现，在四叠半的外面，是另外一个四叠半，在四叠半的上面，又是另外一个四叠半，同样的房间，同样的物件，同样的蜂蜜蛋糕汉堡肉饼，同样的饼熊玩偶悬挂在空中嘲笑着“我”没有抓住面前的良机，“我”试图逃出这个世界，但最后还是妥协，胡子越长越长，身上的气味越来越重，靠着收集每一个四叠半夹缝里的1000日元，现在也已凑齐了十万。 然而，“我”意识到，这一个个看似相同的四叠半，实际上是每一个平行时空里的完全不同的四叠半，这时，邋遢的我看着外面的自己和魔鬼一样的小津混在一起，拜琢磨不透的师傅为师，和爱好人偶的城琦打自虐型代理代理战争，以及高冷却怕飞蛾的明石同学，看着那些无聊的痛苦的社团活动，突然发现自己无意义的生活是如此有趣，突然发现早在借书的时候，就已喜欢上了明石同学，突然发现良机一直就在自己面前。 “我”打破了四叠半的墙壁，冲到贺茂大桥上，那里有小津，有明石，有师傅，有羽贯，有城琦，有“我”陷于四叠半迷宫中渴望的生活。 后面的故事不必多说了，没有什么东西比已达成的恋情更不值得一提了，没有什么故事比一个人重新认识了人生更不值得一提了。 明石同学 看到这里，之前9话那些看似无厘头的剧情在这两话全部有了来头，这种叙事的手段甚至都在平行时空的设定下营造出了一种倒叙的感觉，而最后一话 OP/ED 的大胆互换，更是加强了倒叙的效果，实在是秒极。 本还想结合着最近多说几句自己的生活，再多发几句牢骚，但在欣赏完这部番之后，共鸣之感让我无需多言，所想的，所烦恼的，所渴望的，无非也就是“我”在仅有四叠半大小的迷宫里所经历的种种了。当“我”在迷宫中彷徨颓废的时候，当“我”孤独大叫，装疯卖傻却没人听见，无人知晓的时候，那动画里纸片一样的人物，仿佛就是自己，要是是我困于其中，我又会怎样呢？要是我能重头再来，我又会怎样呢？我现在无意义的学园生活，是不是正是入学时做错了某一个选择呢？我也没有答案。 好在樋口师傅说过 玫瑰色的学园生活什么的根本不存在，要说为什么，因为这个世界本就不是玫瑰色的，而是充满了各种颜色 好在占卜老婆婆说过 良机一直就在面前","tags":[{"name":"thoughts","slug":"thoughts","permalink":"http://yoursite.com/tags/thoughts/"},{"name":"anime","slug":"anime","permalink":"http://yoursite.com/tags/anime/"}]},{"title":"Thinking in Karel","date":"2017-03-01T03:01:33.000Z","path":"2017/03/01/thinking-in-karel/","text":"是的，Karel就是这个只有两只脚的小机器人，他生活在一个由街道交织组成的世界里，他会的动作也少的可怜。同时，Karel也是一门教育用的编程语言，由Richard E. Pattis发明，关于这门语言的进一步介绍，可以自行wiki，这里给出下文中提到的教科书：Karel The Robot Learn Java 书中也有对这门语言进一步的介绍。 接触到Karel，源于最近在跟的Stanford CS106 Programming Methodology，我看的是这门课使用的语言是Java，但作为一门入门课程，这门课选用Karel作为Java的过渡语言，介绍程序设计的一些基本概念。课程网站上提供了运行Karel所需的包与Stanford Eclipse，WIN10下配置起来相当麻烦，这里就一笔带过。 Stanford之所以用Karel过渡，大概是因为他麻雀虽小，却五脏俱全，在同学们初次见到他的时候，Karel只会 move(), turnLeft(), putBeeper(), pickBeeper() 四个动作，而在这基础上，却可以让Karel做出相当复杂的动作。在这个过程中，又可以引入函数，抽象，类，继承等等概念，同时Mehran Sahamil教授在授课的途中也会穿插软件工程方面的细节，像代码风格，注释要求。这样一来，即使是没有编程基础的学生，仅仅通过一周对Karel的学习，都可以对编程有了很深的认识并且也养成了良好的习惯。此举确实高明。 教材Karel The Robot Learn Java上提供的可用函数与语句 这部分结束后便是Assignment 1，这是一个相当有趣也有一定挑战性的作业，要求对Karel编程，解决四个现实问题。Problem 1是要让Karel取到门前的报纸并返回，送分题，主要是为了训练在写注释时的习惯。Problem 2是要打扫街道，主要考察的是循环，也没难度。 Problem 3有点难度了，要求Karel布置棋盘，并且要能够适配任意形状的棋盘，难度出在哪呢？虽然在for语句中使用了计数变量i，但此时课程上还并未介绍变量的定义与赋值，也没介绍判断语句，换句话说就是不能用计数的方式来完成交替放置Beeper的动作。 那么怎么办呢？注意到可用库中有一个 beepersPresent() 函数，通过对当前方块状态的判断，便可以让Karel做出对应的行动。仔细想想这样一个理念，和图灵机的原理神似，都是通过读取当前方格上的数据进行下一步操作。这个Karel，不可小视。 Problem 4也有难度，要求Karel找到第一行的中点并放置一个Beeper，然而，呆萌的Karel不会数数，更不会跳出他所在的维度一眼看到自己生活在一个几行几列的世界里。 Mehran Sahamil在授课时和同学们一起解决了一个问题，让不会数数的Karel将一个方块上的Beeper数加倍，用的是“捡一个，放两个”的思路。类似的，这道题我是通过“两侧压缩”的思路。先在每个点上都放置Beeper，每次转向前捡起一个，再回头抵达第一个没有Beeper的位置，直至最后停在中点。现在描述起来确实容易，但当时做的时候要忘记自己所学过的其他知识，转变思维方式，用提供的这些工具，完成这样一个问题，确实挺锻炼脑子的。 完成Assignment之后，又想起课上教授在解决了加倍问题之后说过的“Karel已经可以解决任何数学问题了”，结合我在Problem 3后关于图灵机的联想，不禁让我感到好奇。便Google了一发，果真如此： Karel在第一行第一列这样一个”L”字形区域活动时，可以看作图灵机中无限长的纸带。 Karel的世界里，方块上有2个Beeper可以代表图灵机中的0，1个Beeper代表1，没有Beeper代表空方格。 图灵机的五个动作（左移一格，右移一格，打印数字0，打印数字1，擦去数字），每一个动作都可以在Karel中由对应的方法实现。 这样一来，Karel这样一个不起眼的小机器人，却有了和图灵机一样强大的计算能力，不禁令人心生敬意。 最后说些题外话，CS106A，找不到合适的形容词来形容这门课的优秀，尤其是Mehran Sahamil 教授，授课幽默风趣，却又能在欢声笑语之中将编程的核心与细节传授与人，关于软件工程的讲述更是相当深刻，私以为这才是 CS 课堂该有的样子，这才是 CS 讲师的标杆。虽然Mehran Sahamil 教授已不再担任 CS106A 的授课，但他还会继续影响像我一样来自世界其他地方的学生。无论是网易公开课，还是Youtube下的留言，皆是赞美与感谢。反观我校 CS 的教学，只得长叹一声，唉……","tags":[{"name":"java","slug":"java","permalink":"http://yoursite.com/tags/java/"}]},{"title":"寒假的最后一天","date":"2017-02-20T10:31:07.000Z","path":"2017/02/20/寒假的最后一天/","text":"到了寒假的最后一天。 并不是严格意义上的最后一天，改签了车票，提前几天返校，倒也不是在家里呆不下去，单纯的觉得开学的前几天在学校的效率可能会高一点，就这样武断的改签了，在家里少呆两天，却是让母亲伤心了很久。 没有母亲那么多愁善感，但外出读书后，才意识到家才是温暖的港湾，家里的床更大更舒适，家里洗澡吃饭随心所欲，家里网速飞快，家乡的粉吃得畅爽，家乡的茶喝得惬意，家乡的夜晚丰富多彩。国庆的时候，一些同学回家，发了这样那样的照片，配上各种文字表情，那时还觉得他们太过浮夸，没必要这样大惊小怪。这次自己回来，才理解他们的行为，才体会到游子对家特殊的情感。 这个寒假过的也很特殊，回家的第一天晚上，兴致勃勃打开家里的电脑，没有反应，检查一下才发现主板烧了，内存坏了一条，CPU估计也不行了，陪了我六年的老电脑，超额跑了很多它跑起来很困难的游戏，到最后都到了玩半个小时冷却两个小时的地步，也算是该退出历史的舞台了。基于这个原因，一个寒假下来，没通关的黑魂3，更新了新探员的彩6，和DHG开黑的Dota2，都没什么机会去碰。无可奈何，却也难能可贵。 这样也好，算是腾出了时间学一点东西，把输在起跑线上的进度赶一点点回来，跟了几门课，做了一些题目，看了一丁点书。什么东西都尝试了一点，学了两门语言的基本语法，接触到了OOP的思想，照着例子写了一个文字游戏，相当简单，但还是写了很久。听了一个学长办的Machine Learning Tutorial，很感兴趣，只可惜水平有限，前置知识不足，听到后面都是在听天书了。通过这种没有重点的学习，尝试了很多新东西，寻觅自己最感兴趣的方向，这样想来，这些时间也不能算作荒废。 回了好几次雅礼：一个人回去闲逛，和老师闲扯。雅礼蓝和同学们重聚，给学弟学妹们答疑。又陪一位友人回去了一次，聊了很多东西。今天又跑回去买了两条校裤。重逢的感觉很好，大家都有或大或小的变化，倒是只有我还像一个高中生一样，和他们一起看电影一起吃饭一起扯东扯西，感觉又像回到了高中的时候，各种各样的情绪又重新涌上心头，还要用相当长的一段时间来慢慢消化。当然，也和初中同学重聚了，一起去给班主任黄哥拜了年，那也是相当开心的事。不过也有令人伤感的地方，这是大家大一的寒假，尚且还可以聚在一起，尚且还可以看到这么多面孔，之后每个人会有每个人的生活，有自己的安排和计划，走着自己的人生道路，再次聚在一起的难度只会越来越高了。 在这最后一天回首整个寒假，像流水账一样记下发生过的事情，让后来的自己能有东西回忆。 明天便要出发去学校了，上个学期走的前一夜，很是伤感，感觉要和什么东西说再见了，放不下一些本来就虚无缥缈的事情，完全没有踏入新的大学生活的喜悦，这种不好的情绪也一直延续了整个学期。这一次的出发，消极的情绪不再有了，希望自己在马上开始的新学期里，完成自己的目标，不虚度光阴。 寒假的最后一天要结束了。 十九岁的第二天也要到来了。 重聚PHOTO BY Steven","tags":[{"name":"thoughts","slug":"thoughts","permalink":"http://yoursite.com/tags/thoughts/"}]},{"title":"推歌·漫谈","date":"2017-02-02T13:56:33.000Z","path":"2017/02/02/推歌漫谈/","text":"大二上学期2018-02-02 大二上学期结束在北京西站，求是潮手机站终于刷出了最后一门成绩，同时也踏上了回家的路，一个漫长的学期落下了帷幕。 这个学期是一个相当有意义的学期。除了杭州和长沙外，还去了上海和北京两座城市，有了许许多多的新见闻和新感受。参加了军训，跑过LV，熬过不少的夜，写过许多垃圾代码，就算是吃的方面上，也吃了不少的深夜炸鸡，喝了不少下午的一点点，别人的BG和自己的BG也都吃的很开心。唯一的遗憾，大概也就是没下定决心搞科研。 最后的一月份过得还是相当tough的，在此还是要认真感谢SG同学，几乎以一人之力高效且质量爆炸的完成了数逻project，否则真的挺难熬的……考试周的考试数目几乎是大一一年之和，虽然开学时想过每一门课平时好好学，期末复习的压力就小，但到最后还是堆成了一座山……在考试周前有个大概的预期，这个学期没思政课，数学课也就一门难度不大的概统，在加上专业课很多，感觉自己绩点有希望拿一个稍微好看一点的数字。嘛，最后很遗憾，预期能满14分，只满了9分，概统，OOP双双翻车，绩点也差一点上4.5。 简单谈谈这个学期上过的课： 大学英语V：黄小扬老师是我这个学期所有课程中最好的老师，没有之一，能把大英这样一门设计的如此垃圾的课上到我可以接受的水准，确实是有水平，口语也是我遇过的浙大老师中最好的一个。这门课虽然最后拿到的分数还行（没能拿满有一点点对不住那么高的平时分），但通过这门课真正学到的东西不多，反倒更像是一次警醒，告诫自己不能再依仗着高中时的老本了，要想出国继续读书，T和G是绕不开的，紧张的时间线也不允许在专门找大块的时间学英语了，得赶紧了。 概率论与数理统计：本学期唯一的数学课，也是当时唯一有希望满的数学课，然而我也不知道为什么期末只考了那么一点……我姑且认为自己学的还是不错的，至少老师想让我掌握的知识和解题技巧我都掌握了。然而我深知概统的重要性不会单单停留在这一门2.5学分的课程上，无论是传统机器学习还是DL，无论是CV还是NLP，都要用到大量的相关知识，就连现在这道RELION的题目也是基于贝叶斯估计的原理，所以若有时间，真的得好好学概统。 面向对象程序设计：Janice Regan，这位老师的课其实上的还行，只是我每次都很困……但是她布置的作业真的不敢恭维，太混乱了……C++虽然显然不能靠校内的课程学，但总觉得学的还是太少了，也就停留在hello world的水平，这很大程度上是我自己的原因，代码写太少。寒假用C++糊个DB来练习一下吧。 数字逻辑设计：这门课的定位很迷，我认为根本没有开设的必要，计组一下就cover了，说白了还是所谓名师SHI老师想搞业绩，搞一套什么硬件体系，最后就是时间大量浪费在了写无用的游戏代码而不是学习真正的体系结构，导致这一套体系课程上下来，无论是深度还是广度都比不上人家世界一流。连我都能一天入门的理论，有必要拿一整个学期来上吗？ 数据结构基础：这一系列课又是另一位名师CHEN老师的“杰作”了，所以说贵校CS成天就在课程名字和系列上做文章，也不看看自己课程的内容干涩乏味到什么程度。不说别的，CY你做的那么丑的slides，你也好意思上课？好意思查别人代码的优劣？你配吗？我要是你我都自杀了。这个学期开学那一次查重和误杀以及后来GGB事件的刑不上CKC，基本上让CY的诚信守则RIP了，享年一岁。言归正传，数据结构和算法本应该是CS本科最核心的课程，我也不知道怎么就上成了这样……就我个人而言，我认为我没学到我这个年级应该掌握的水准，还是自学的太少，期末考试差点翻车…… 大学物理：必修，不做过多评价。最后刷了一整夜期末拿了93分，可惜期中不够高否则有机会可以满，遗憾。 大学物理实验：傻逼课，纯粹恶心人的课，虽然有些老师不错，但我认为有些老师（对，就是指的XWW）以及最后那张试卷就是弱智。 日本艺术欣赏、希腊罗马哲学、物理与人类文明：通识课没有错，错的是必修14分通识和通核和J类，这是贵校三本论的一大有力论据，通识课上了这么多还真没见过几门有意义的，大家无非都是在凑学分罢了。日本艺术欣赏意外的高，但是这课远远低于我的预期，唯一一次展示的机会居然因为时间不够给我掐了半截。希腊罗马哲学，老师是一个高度自大的人，不评价。物理与人类文明居然是本学期最低，不过考虑到付出的时间，就这样吧。 回家两天，稍事放松，和沁狗出去浪了一天，很开心。接下来的工作是: RELION优化 《CUDA并行程序设计–GPU编程指南》 《并行程序设计导论》 《数据库系统概念》及MYSQL大程 看动画 Happy holiday! 平安夜2017-12-24 在512用大电视看了每年的惯例–《龙与虎》的第19话。 今年的平安夜没有总结，不是因为不想有，而是因为没有时间写，欠下的东西太多，之后还要加油。拼命加油。 此处应有一首《ホーリーナイト》，版权原因。 十一月总结2017-12-08 十一月还是过的相当的糟糕的，不，非常糟糕。主要原因是因为各种原因熬夜，通宵，这太伤身子太伤精力了，功课也没考得很好，所以最后相当于什么也没得到……哎，不过这一段时间倒是思考了很多事情，关于我自己的未来，关于我之后性格走向，我自己的为人处世，嘛，只能算是还有点意义吧…… 瞎扯2017-11-26 第一次有了会不能按时完成作业的害怕。 但还是打算瞎扯点别的。 2017即将结束，谈一下给我留下了深刻印象的日本人： 声优总所周知，我是一个声豚，我喜欢的声优有很多，但今年给我深刻印象的是两位： 黑泽朋世：配音功力没得说，今年感觉也是一个新的上升期。但主要还是太可爱太有活力了，马上就可以去上海看Tomoyo了，非常非常期待。 洲崎绫：30岁的BBA了，早点找个人嫁了吧可能是你推特首页最好的萌宠博主。要说圈粉还是在灰灰的4th的BD中，真心好看啊，声音也挺好听的，人也相当Nice，感觉自己真的已经是一个立派的呸厨了。 都是灰姑娘可还行 歌手 椎名林檎：无敌女王，无论是东变还是个人的作品都太对我的胃口了，这一段时间真的就是靠听女王的歌维持自己的生命，演唱会也非常非常精彩，尤其是66th红白上的演出，惊艳。 星野源：年初时非常痴迷于逃耻和Gakki，但细想下来星野源也是一个相当有意思的人，歌手，红白歌会上的表现相当稳健，声优，配了今年我觉得最优秀的动画电影《春宵苦短，少女前进吧》，演绎的十分到位了，和花泽小姐也很搭，MikuP还行 我也不知道为什么突然想谈一下这四个人，权当做个记录吧。 还行与不行2017-11-20 本来是在11-13就打算写这一条的，拖着拖着还是拖到了现在。 考试周结束了，物理考得不好。 除此之外，总算开始吃到了大一一年不好好学数学带来的苦头，之后可预见还有相当多。 欠了一屁股的债，以及还有必须得完成的事情。 这是不行的地方。 还行的地方有两处。 一是上周一补周四课，在实验课上又看到了那位女生。只可惜实验简单，我很快做完便匆匆离开了。 再就是昨天考完听到了相当好听的活动曲，同时也看了部分的灰姑娘六周年生放送，看了LIVE的尾声部分，以及目睹到了很多爆炸的发表，真好啊。 照例，苹果 唉2017-10-19 虽然还欠了很多作业没写，虽然还欠了一篇肯定会写的长文谈谈最近发生的事，但是还是一如既往地优先扯点别的。 大物实验，抛射体运动的照相法研究，老师一来说让我们先等半个小时，于是到外面继续看并行。 回到教室，听老师开始讲实验操作，可视线却被老师旁边一个女生吸引，啊，感觉真好啊，就是感觉真好啊，感觉很醒瞌睡。接下来整场实验都时不时注意一下这位女生，可惜最后自己也没有任何一点勇气去聊上哪怕任何一句。 但是果然我还是喜欢这种看着就很清爽的女生啊…… 继续忙去了…… 最近沉迷DAOKO，这妹子的歌都好听 牢骚2017-09-27 弱智大物实验，傻逼课 弱智的我，我大一在玩球？绩点怎么这么低？ 绩点低真是寸步难行。 夜行2017-09-24 了解一个城市最好的时间就是夜晚。 去年看完君名从遥远的地方回港一路上就有这样的感受。 今天也是，一个人从东四走到银泰去看电影，杭州，没那么无聊，有那么一点点味道。 SAO的剧场版，还行，我内心里和TV版评分差不多吧，7/10，有些地方完全可以做的更好。但是整体还是不错的，看过前作的都会看得相当爽，打斗也很多，就是由纪出场时间太短，很残念…… 只是某些现充严重影响了观影体验，很不爽，唉，动画电影还是一个人包场看的舒服…… 想在这放一首LISA的シルシ，版权问题 假期（二）2017-08-10 刚刚过去的八月九日也是非常愉快的一天。 早上起来在微博上刷到军神关于5th 福冈站的推特，心情就非常好。 下午也是平稳的看了一下午书，之后更是出现了今天的 highlight。 [数据删除] 晚饭后终于把冰菓第六卷读完了，很有趣。 嗯，假期真是舒服。 最近喜欢上了椎名林檎的歌曲，太迷人了。 假期（一）2017-07-31 回家已经快10天了，记录一下难得的假期生活。 kawaii make my day 法子活动顺利结束，最后是3.7k的排名，算是二档靠前，最后大家的分数冲起来确实跟不上。两张活动卡都顺利拿到了，都很可爱，非常妙。我也不知道为什么标题没有加s 结果复刻的两张花嫁卡出的时候，没忍住，把自己攒了很久的7k5星星都抽完了，结果30连什么都没有，又没忍住，氪了一单，继续30连依旧什么都没有，非洲人确信。果然这种靠运气的游戏不适合我，我还是靠活动卡过日吧…… 再就是玩了下黑魂3，目前到达冷冽谷，abyss watchers是真心帅，真是一场令人酣畅淋漓且印象深刻的boss战，虽然某个NPC被我召出来结果遭一套街舞砍死了…… 游戏到此为止。 27日和cqy, lzy, wzr相聚，上午去了密室，顺便看了一路的秀秀秀，真是好啊，羡慕啊。下午随便闲逛了会儿，在costa坐下，cqy用我的电脑玩 LIMBO，玩到三点半，突然听到背后某人说塑普的口音巨像cry大神，一看，惊了，正是cry，她和cqy, lzy的好友lst坐在一起，这下就热闹了，我去和cry聊天，还没聊上两句，她旁边一桌的女生突然认出我们来，惊了，大白和她的闺蜜崔神，惊了惊了，所以说长沙真是一座很小的城市，碰到熟人真是一件很容易的事情。那天陆续还来了很多认识的人，不认识的人，一起聊天，听大神讲真正的世一大的轶事，吃饭，是非常精彩有趣的一天。 30日又和lzy(是的又有她哈哈哈哈), wy, tcw, qg相聚，计划下午去密室，上午本以为要水过，结果去了悦方的costa坐下后(是的又是同样的地方)，这次没有碰到别的熟人，另外三人在玩某著名手游，qg在用我的电脑玩fallout shelter，之后又玩了一会儿LIMBO，虽然限于难度又继续回来玩fallout shelter(这个时候发现fallout shelter的耗电速度其实是比LIMBO快的)，玩了好一阵。之后去吃午饭时又玩了下CGSS(偷笑hhh)。下午密室结束后回了趟yali，依旧是熟悉的感觉，甚是怀念。晚上吃完晚饭后，qg由于父母还在外，和我在starbucks里又玩了一会儿fallout shelter直至我的surface耗尽了最后37%的电量，之后又玩了一会儿的monument，最后送她上了出租车，才算是结束了这也是相当有趣的一天。 感想吗，这两次下来，首先是真的有一种强烈的错误的不存在的感觉感觉自己要成为一个现充了，再者就是看别人玩游戏是一种完全不同的体验，尤其是看qg玩，太有趣了。 [数据删除] 是的，我是一个死宅。意识到这一点的时候是看到微博上P们分别去了5th的福冈巡演和广州的麽多看Hego，这也真是好啊，感觉没去的自己损失了几百个亿。可是确实是穷啊，不仅是穷钱，而且还穷胆子，穷这股魄力啊，大概在下就是一个废宅吧…… C++真是迷啊…… 深夜快三点了，好饿啊…… And if thou gaze long into an abyss, the abyss will also gaze into thee. 学习一下2017-07-26 好久没更新这个所谓的博客了……才结束了小学期，回家休息了几天，小学期课程的成绩倒是不错，挺满意的。 然后就是在肝CGSS的活动，刚开的时候还想着可以冲进一档，这几天dalao们开始2*4的肝，我的名次刷刷刷的往下掉，再要进一档估计要把星星都用完……穷人还指望着靠着这为数不多的星星脱非奔欧的，保个二档就行了吧…… 剩下的时候就是在看 C++ Primer，然而，看的时候，我的反应如下： 这门语言……怎么说呢，繁琐的过头了吧…… emmm，这次的歌就用 flip flop 吧，毕竟是刚刚学过的东西…… 好累啊2017-06-28 啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊好累啊 呃呃呃呃呃呃呃呃呃呃呃呃呃呃呃呃呃呃呃好困啊 我不想挂科啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊 再摸一会儿鱼2017-06-24 好久没熬这么晚了。 窒息。 悲凉。 一首歌 alien 歌词看了下，相关度不大，单纯因为旋律好听。 这样的歌还能听多久呢，呵呵，BB你说呢？ 摸一会儿鱼2017-06-21 大物书姑且过了一遍，我不是天才，显然不能一遍记住所有的公式，现推明显也不靠谱。 啊并不想做题，还有点时间再看下calculus 对当前自己所处的环境有着种种不满，但是正是如此才更需要摆脱。 Yali 14级的同学们昨天举行了毕业典礼，突然想起了一首歌，这首歌每年六月都会听，非常适合毕业的季节。 （题外话0：原曲名さよならメモリーズ，收录于 supercell 的同名二专，我第一次听到是在专辑 Today Is A Beautiful Day 里听到的，这是 nagi 离开 supercell 前的最后一专。nagi 时代的 supercell 是我最喜欢的音乐团体，而 Today Is A Beautiful Day 一直是我最喜欢的一张专辑。） （题外话1：索尼的版权一直管的很紧，这很好，所以这里采用了我很喜欢的钢琴家 Animenz 的二次创作版本。） （题外话2：A叔最近有全国巡演，9月9日在杭州有一场，可惜因为 Patt 的课延期军训的我当时应该正好在军训。） 非智力运动2017-06-18 今天是高中毕业一周年。 最近一直在做一些非智力运动，根本不用动脑的。 按照模板把文档转换成展示用的slides，背诵 (完全没有用的) 行策资料，还有一些乱七八糟的事情。 马上又要考试了，大物完全不会，微积分和离散也要复习一下前面的，巩固一下后面的。好在还有八天…啊七天了，慢慢快快复习吧。 最近染上了很多陋习，比如说晚睡早上起不来，这样很不好，一定要改掉。 偶像大师，最近一直在看，在听歌，有元气真是好啊！ 客厅滑跪2017-06-04 爽！ 呆在寝室里开心的摸鱼，突然在微博上刷出了京吹的消息。 完全新作！剧场版！两部！ 吹吹人昂首挺胸！有机会希望能在2018去宇治现场看，然后BD买到爆。 爽啊。 难得轻松2017-06-03 感觉离上一次更新已经过去了一个世纪，不过也确实，事情稍微一多，自己又经常磨磨蹭蹭、拖拖拉拉，就每天每天都处在“还有好多事没做不能玩啊啊啊啊啊”的状态，虽然话是这么说但是每天其实都在摸鱼。 所以简单总结一下忙碌的五月，从家里回来之后考完了离散的 midterm 89+5，错了两个智障的空， bonus 居然得了五分很意外。然后两天内写了 project 1和2，相当爆肝，虽然并没熬夜，虽然并写的不好，虽然并是在摸鱼。之后到校庆也是一直在摸鱼，然后校庆四天居然只写完了个人作业，惊了，太摸了，玩也没玩到什么，睡也没睡饱，懊悔啊。然后就是上周，周四的 quiz 考得不是很好。本来 project 3 打算靠一下队友或是照搬一下学长的，但是队友不靠谱的直接把原样例提交给我，再加上纠结来就纠结去觉得既然要写就还是好好写，所以四天的假期又花掉了 3/4 写了这个很简陋的 CAD 。最后一天倒是摸得很爽，四公主到了，尼尔比想象中的好玩很多。这周把个人作业，LJY 拜托的大作业都写了，按理来说也有充裕的时间写完 project 4 和复习一下，但是已经过去了两天的周末也是彻底的在摸鱼。 嗯，这么看来的话我的人生价值似乎很简单，写代码和摸鱼，似乎很 coder，但是还是老问题，至今写的代码和 hello world 没有本质上的区别，说白了就是自己的自学计划还是开展的十分失败，2017马上要过去一半了，书没看多少，课也没跟多少，只有吹逼的技能一直稳步的提升。常常会想，究竟是这失败的三本院校让我变得如此失败，还是正是因为我的失败，正是许许多多像我一样，天天躲在学校里摸鱼度日的失败者的失败，才导致学校背上失败的名号呢？ 不管了，想清楚也没有好处。 手上卡着的书主要是这几本 《编码》 《计算机系统概论》 《数据结构》 《数学之美》，看能不能在放假前看完，虽然感觉很不现实，还有完全没有复习的六级要考。 不过确实是难得的轻松啊，听会儿歌吧，今天的曲子是京吹2一首非常重要的曲子，也是点题的曲子———《吹响 上低音号》 空虚2017-05-20 三日月の舞就留给长文吧 校庆，与我无关，有四天假期。 在这第二天看完了囤了很久的京吹第二季。 很好看。 看完了非常空虚，啊啊啊啊啊啊好空虚啊，看完之后感觉整个人都升华了也虚脱了，都不知道该干什么了。 浮躁2017-05-15 什么叫浮躁？ 我认为的浮躁就是欲望太多。 School Pride2017-05-14 扯点闲谈，最近世界一流三本大学就要120周年了呢，为了校庆，学校到处都在拆拆建建，吵吵的呢。连路牌上的校名英文都能印错的呢。有意思。 前几天倒是也有一件有意思的事情，据说是纽约的帝国大厦在校庆当日会亮蓝灯以示纪念，哎哟，不错哦，去官网一看确有此事，昨天又看到黄浦江和钱塘江两侧亮起校庆灯光的照片，居然还有这样的操作，可以可以。 周围的人也是开口闭口就是校庆了，可惜我实在没太大兴趣，入校快一年，并没有太多的归属感以及自豪感，校庆两天假，赶作业啊。 反倒是另外一件事，让我体会到了什么叫做 School Pride 。 某U同学在研究 NLP 的时候参考了斯坦福的 CS224n，然后突然跟我说了一句“到处都是你们雅礼的人”“Head TA 是雅礼的” 我连忙打开 CS224n的网站一看，Danqi Chen, 斯坦福的 PHD，履历很强，但是仅仅看到了出生于长沙的信息，并没有说明她是雅礼毕业，然后看到杂项里有两篇论文，一看这下就懂了，论文标题下便是“长沙市雅礼中学 陈丹琦” 基于连通性状态压缩的动态规划问题 从《Cash》谈一类分治算法的应用 以上是两篇学姐在国家集训队时所作的论文，都很强，第二篇尤其有故事，U同学跟我说“cdq分治为OI直接引了一大批新题型进来”，我当时还没在意这个所谓的”cdq”，第二天仔细看这篇论文结合网上查询才发现这个”cdq”居然真的就是学姐的名字，可以说学姐自创了一种算法，太强大了。 至此，真的觉得雅礼很强，雅礼人很强。 学姐是研究NLP的，最近我也对NLP产生了兴趣。 论文还没写完。 地獄之后2017-05-06 闷热初夏天 新到冰菓第五卷 竟早已看过 —————–《即兴最上川》 昨天晚上和室友闲扯，扯到冰菓续集的问题，于是便去看看米泽穗信写到哪了，惊讶的发现古典部系列居然在去年又推出了新作《事到如今才叫我飞翔》，又查了一下实体书，发现在这之前的《两人间距离的概算》已经出了实体，于是马上便买了一本。今天中午取到书的时候，突然意识到这本书的电子版我早已看过，啊，原来已是看过的内容了，不过也没关系，本来也要买一本收藏的。这一周算是过去了，离散考的一般吧，不过应该也不会太差，两个 project 通过前天晚上昨天一整天的赶工也总算告一段落，迷宫因为之前写了所以没大改动，主要就是写个报告，然后意识到不会 LaTex 真是相当糟糕的一件事，md 根本就不是用来写报告的…… 至于多项式的话，比我想象的难，本来想支持整个多项式的复杂输入，但是写了半天发现既不优雅也不正确，作罢，写了一个最简单的版本。晚上shige的多项式写完，让我帮忙找一下 Bug, 他的多项式功能可以说是非常完备了，有简易版数学软件的潜力，今天早上又看到用 LaTex 写的赏心悦目的报告，不禁感叹人和人之间的差距真是比狗和人之间还大。之后还是要忙，不过会有一些自己的时间，总算是可以做点自己的事了。 地獄2017-05-02 接下来一段日子就是地狱啊 狗才摸鱼2017-04-29 我就是狗。 摸过了midterm，顺便也摸着摸着回了家。考试这个东西真是摸不得，一摸就现行，摸的还是这么重要的两科，惨啊。当然，摸鱼也是有摸鱼的收获的，比如意识到了有的事情再也不会做第二次，比如说早上三点起来赶夜班公交的极其愚蠢的行为。 回家了就是爽，说好要写作业的，结果开心的吃了一天，看了一天的视频，爽到。 突然想到五月又有很多事情要完成，心情变得沉重了起来。 阿西，快24小时没睡了，先睡一觉再说。 RE: I AM2017-04-20 说点什么呢。说是说已经习惯享受着一个人的生活了，可总有某个时候突然想要一个可以说话的人，就比如今天，中国绘画史结课，最后一节是实践，第一次试着画中国画，虽然根本不知道可以调墨色，拿起笔就开涂，但是确实挺有意思，非常有趣，还被老师当了范本，虽然是用墨过猛的范本。拿着自己第一幅中国画出来，突然好想跟人说“你看，厉害吧”，但一想，大家都有各自的事情，也没谁能听我说这种事，这个想法也最终作罢了。 从实验中心回来的路上，夜很黑，树很茂盛，这个时候听Aimer的歌很合适，最近又回到了狂热的Aimer厨的状态，一遍又一遍，尤其是After Dark里的live in church部分，充沛的情感，慢慢的速度，一曲结束之后Aimer低声的MC和钢琴的过渡，给我一种熟悉的感觉。音乐真好啊。 这样看来，无非是无病呻吟罢了，无非是矫情罢了。 高扬感2017-04-15 离散的quiz又没考好……一道看到了但是觉得不会考的原题没做出来，自作自受，认了。 史纲的展示倒是突然延期，也算是暂时少了一件事。 原计划周三撸完的学术垃圾论文，可周三才把《图说中国绘画史》大概看了一点，写了大概1K4，基本上就是把书上和别人的论文翻译一下，这有什么意义，这不就是学术垃圾，周五实在觉得写的惭愧，于是从头来过，这一次至少主题是自己想的，今天晚上修改了一下格式，总算是弄完了。 下午是体测，上午开始就十分紧张，甚至没办法做正事，只能看动画听歌缓解情绪，分析了一下大概是高考第二天开考前的状态留下的后遗症，导致现在有考试恐惧，无论是笔试还是这种体能的测试，都会感到非常的非常的紧张，今天测跳远和1000米以前心脏都感觉要跳出来。不过最后体测的结果还算好。 版权问题只有TV版 为了放松，看了一下以前看过的微博和视频，然后顺着就看了很多声优向的东西，感觉自己又要变成一个声豚了，接着又看了ASL2016，本来是奔着佐仓去的，但是突然看到day2的京吹部分，太棒了，トゥッティ！ 响起的时候整个人都为之一震，黑泽等四人登场的时候真是活力满满，洋溢着青春的高扬感，于是便把这首歌听了一遍又一遍，把live的片段看了一遍又一遍，真好啊，四月也同时在追三部番，感觉自己又要找回以前看动画时的感觉了，一个人看动画绝壁是世界上最舒服的事情。 高扬感真好啊，希望接下来的考试也能一直高扬下去。 四月第一周2017-04-10 第一周结束，完成的事情有没起床的马拉松，一个回笼睡醒之时，室友已经跑完了。 以及被初中生虐出翔的比赛，总共就做出两道，A和J，都是签到，红色蓝色的气球，人人都有，也就没好意思带出来了，姑且有图一张。 总结起来对自己的发挥还是挺不满意的，C其实是做过的题，但是花了很长很长的时间才把逻辑理对，写出来的时候也是TLE，还有几题如果跟着MOOC走了应该也写得出。但是呢，这次比赛被初高中生屠场了，就显得大学生普遍很弱，无论是求计还是那些所谓搞过竞赛一直把竞赛挂在嘴边的前任选手，实力都不是太强，感觉自己继续发展下去是肯定能超越的。 这周就是离散的Quiz，一直拖延的绘画史论文，史纲课的展示（自找的麻烦……），周六的体测。 论文真是难写啊…… 不知不觉都快四月中旬了，可身上还穿着冬季的衣服，去年这个时候早就只穿卫衣了吧，去年的四月中旬，那可发生了不少…… 《C》里的一首 《RPG》，高二时经常听，曲子不错，可惜番不大感冒，也就不看了，很喜欢这句歌词 世界中の全ての謎より 知りたい 君の心を 夜行航班2017-04-05 体测要及格啊，带着这样的想法，这几天又恢复了高三时的夜跑的习惯，除了自己体质指数下降后跑一会儿就气喘吁吁以及没有一起跑步的朋友外，其他也无太大差别。 学校附近有两个机场，一个是军用机场，很难说离得近，但是萨德事件风声最大的那几天，一直有战机呼啸而过，难免让人担心。另外的一个便是萧山机场，离得不远，但是却没有直达的公交或是地铁，从紫金港过去很要折腾。 五一假期准备回家，本想乘飞机，但没有合适的班次，还是得早晨起来赶高铁，又是四个多小时的高铁，人都要坐废。 好久好久没有坐过飞机了，上一次还是高一的暑假，从重庆一个人回来赶暑假作业，之后的两年再也没有上过天空。不过也自然，连长沙都没出过，又哪里需要乘上飞机。 跑完，在跑道上慢走的时候，深色的天穹中飞过一架航班，机翼上闪着红色，黄色的灯，发出与空气摩擦的声音，缓缓消失在云层之中。不一会儿，又是另外一架，又是一架。时间已是十一点，这些向南飞的夜行航班，上面坐的是一些什么人呢？他们又要去向哪里？又要以怎样的精神状态面对明天的生活呢？ 不同的人生阶段做同一件事会有完全不同的体验，这一点在成年之后许许多多的事情里已经深知了，然而，我突然想知道，若是我自己，坐在这样一架夜行的航班之上，望向窗外，又会是怎样的心情呢？ ……2017-04-03 清明的天气真好啊 同学们在世界各地玩啊吃啊，发许许多多的照片 我也想出去了，可是一个人也没什么好玩的 假期真是难熬啊 本周要开始写论文了，然后还要准备比赛和期中考试，project2应该也快了 熬过这一周就删 然而并没有删反而变成了专楼","tags":[{"name":"thoughts","slug":"thoughts","permalink":"http://yoursite.com/tags/thoughts/"},{"name":"music","slug":"music","permalink":"http://yoursite.com/tags/music/"}]},{"title":"Hello Miyamizujinjya!","date":"2017-01-28T15:10:50.000Z","path":"2017/01/28/hello-miyamizujinjya/","text":"总算是可以敲下这样的标题，自己的个人博客终于是有了一个雏形，终于有了用于胡思乱想和记录学习历程的地方。姑且算是自己又向前迈了一步吧。 高三以来一直有纸笔写随笔的习惯，排遣情绪，但有些东西仅靠白字黑字并不能完整表达，需要借助一些外部工具。进大学的时候就有了在网上写东西的想法。但QQ空间、朋友圈、微博过于喧嚣，传统的博客又落入俗套，恰好在思修课上认识的同组同学梁子木在课上给我展示了使用 github pages 与 jekyll 搭建的个人博客，简洁精致，当时我就心动了，也筹划着自己去搭一个博客。接下来的日子里，遇到问题，总是能在各种巨犇的博客找到解答或者启示，自己平时学习过程中，也有一些东西想要去记录。 于是，基于情感上与学习上的双重原因，这个博客由此诞生。“宫水神社”——miyamizujinjya， 购买域名的时候恰好沉迷于《你的名字》，沉迷于三叶，于是乎也就顺理成章的买下这个域名，定下了博客的名字，在脑海里对自己博客的风格有了个模糊的感觉，现在呈现在眼前的即是这个可以称做“半成品”的“成品”。博客基于 github pages 与 hexo , 主题使用的是国人Litten 的 Yilia —- 完全符合“简洁精致”定义的主题。搭建过程中确实是磕磕绊绊，自己毫无前端方面的知识，即使用的都是现成的工具也是问题不断，一开始用 jekyll 尝试时莫名出现了各种问题，索性直接换了 hexo 重来，这一次倒是还算顺利，一路上接触到的新东西数不胜数，深有“哀吾生之须臾，羡长江之无穷”之感。但是着实有趣，整个过程更像是一次艺术之旅，一边欣赏着别人的博客，一边学着知识，一边还感叹自己缺乏艺术细胞。未来的日子里，随着进一步的学习，这个博客肯定会被继续改来改去，究竟改成什么样子，那都全看我的心情。 总算是可以开始了，以后就是在这个博客上发一些牢骚，记一些学习过程中大小发现，寒假过去了12天，自己远远落后于计划，感觉是要完不成目标了……哎，每年好像都是这样，拖拖拉拉，按照计划博客本应是年前投入使用的，拖延症啊……回家以后，环境比学校好了不少，但自己的效率依旧极低，归根结底还是不能做到心如止水，始终静不下心，总是自己干扰自己，这并不是一个好的态度，无论是治学还是为人处世。过去的18年因为这一点已经吃了不少苦头，之后若是继续下去结果也可想而知。希望自己能在未来的道路上慢慢改掉吧。 差不多就这些吧，最近被新年弄得睡眠严重不足，中国的新年有一个很大的特征便是时间不属于自己，属于那些并没有多少往来的亲戚，属于那些纯粹是礼貌性的拜访，说实话，我并不喜欢这样的人际关系，也并不喜欢这样的过年方式，无奈人是社会性的动物，不得不在社会中生存，不得不服从于社会中的处事法则。 最后，欢迎来到宫水神社。","tags":[{"name":"thoughts","slug":"thoughts","permalink":"http://yoursite.com/tags/thoughts/"}]}]